In [91]:
import pandas as pd
df = pd.read_csv("../../Data/grades/student_grades_2024.csv")
df.head()

     Name  Math  Science  Reading  History
0    Adam  11.0      9.0     16.0     13.5
1    Anna  12.0     11.0      8.5     10.0
2   James  11.0     18.0     11.5      9.0
3   Corey   7.0     15.5     11.0     14.0
4  Alisha   9.5     12.0     10.5     14.0

In [99]:
mean = df.mean(numeric_only=True)
math_median = df['Math'].median()
history_mode = df['History'].mode()
print(f"{mean}\nThe median for Math is: {math_median}\nThe mode for History is: {history_mode[0]}")

Math       11.928571
Science    14.214286
Reading    10.785714
History    11.428571
dtype: float64
The median for Math is: 11.0
The mode for History is: 14.0

In [58]:
correlation = df.iloc[:,1:].corr()
correlation

             Math   Science   Reading   History
Math     1.000000  0.269494 -0.268562 -0.718358
Science  0.269494  1.000000 -0.527606 -0.358688
Reading -0.268562 -0.527606  1.000000  0.206794
History -0.718358 -0.358688  0.206794  1.000000

The highest non-negative correlations are between math and science.

In [86]:
grades = [24, 5, 15, 60, 54, 82, 99, 80, 70, 98, 93, 60, 33, 22, 65, 61, 51, 58, 83, 86, 42, 67, 60]
grades = pd.Series(grades)

def desc_stats():
    print(f"Mean is {grades.mean()}")
    print(f"Median is {grades.median()}")
    print(f"Mode is {grades.mode()[0]}")
    print(f"Min is {grades.min()}")
    print(f"Max is {grades.max()}")
    print(f"Range is ({grades.min()}, {grades.max()})")
    print(f"Variance is {grades.var()}")
    print(f"Standard Deviation is {grades.std()}")
desc_stats()

Mean is 59.47826086956522
Median is 60.0
Mode is 60
Min is 5
Max is 99
Range is (5, 99)
Variance is 694.3517786561265
Standard Deviation is 26.350555566365703

I would curve personally, the mean is failing, by just a bit, and the median/mode are quite low as well. While the max is 99, there are only 3 90's overall. And 5 as the lowest is *really* low.